"use client";

import { useState } from "react";

const tabs = [
  {
    name: "رندرینگ و انیمیشن",
    content:
      "تصاویر و ویدیوهای فوتورئالیستیک این توانایی را دارند که پروژه شما را به سطحی بالاتر ببرند و به آن جان و شخصیت ببخشند. در استودیو Qoo، تیم خلاق ما انیمیشن‌هایی ویدیویی خلق می‌کند که داستان پشت پروژه‌تان را به شکلی بصری و جذاب به تصویر می‌کشد. این انیمیشن‌ها با هدف نمایش ویژگی‌ها و مزایای پروژه شما طراحی شده‌اند و در عین حال باعث افزایش تعامل و جلب توجه بیشتر به کمپین‌های بازاریابی شما می‌شوند.",
  },
  {
    name: "طراحی و لمس Qoo",
    content:
      "Qoo Box یک تجربه تعاملی با صفحه‌نمایش لمسی است که برای معرفی پروژه‌های املاک در قالبی شیک و کاربرپسند طراحی شده است. کاربران با یک لمس ساده می‌توانند نقشه‌های طبقات را مرور کنند، رندرهای فوتورئالیستیک و انیمیشن‌ها را مشاهده کنند و حتی فضای داخلی را سفارشی‌سازی کنند — راهکاری پویا و غوطه‌ور برای تعامل با پروژه.",
  },
  {
    name: "تورهای مجازی 360",
    content:
      " با بردن تورهای مجازی یک قدم جلوتر، توسعه‌دهندگان می‌توانند این امکان را برای خریداران فراهم کنند که پکیج‌های نهایی را مشاهده کنند، نمونه‌ها را با هم مقایسه کنند و حتی از طریق یک قرار ملاقات آنلاین دکوراسیون، خانه خود را شخصی‌سازی کنند. با اجازه دادن به خریداران برای پیش‌انتخاب و قیمت‌گذاری گزینه‌هایشان، توسعه‌دهندگان می‌توانند تجربه‌ای شخصی‌سازی‌شده ارائه دهند که به خریداران کمک می‌کند خانه رؤیایی خود را طراحی کنند.",
  },
  {
    name: "محصولات مجازی",
    content:
      "با بردن تورهای مجازی یک قدم جلوتر، توسعه‌دهندگان می‌توانند این امکان را برای خریداران فراهم کنند که پکیج‌های نهایی را مشاهده کنند، نمونه‌ها را با هم مقایسه کنند و حتی از طریق یک قرار ملاقات آنلاین دکوراسیون، خانه خود را شخصی‌سازی کنند. با اجازه دادن به خریداران برای پیش‌انتخاب و قیمت‌گذاری گزینه‌هایشان، توسعه‌دهندگان می‌توانند تجربه‌ای شخصی‌سازی‌شده ارائه دهند که به خریداران کمک می‌کند خانه رؤیایی خود را طراحی کنند.",
  },
  {
    name: "رندرینگ",
    content:
      "تصاویر و ویدیوهای فوتورئالیستیک این توانایی را دارند که پروژه شما را به سطحی بالاتر ببرند و به آن جان و شخصیت ببخشند. در استودیو Qoo، تیم خلاق ما انیمیشن‌هایی ویدیویی خلق می‌کند که داستان پشت پروژه‌تان را به شکلی بصری و جذاب به تصویر می‌کشد. این انیمیشن‌ها با هدف نمایش ویژگی‌ها و مزایای پروژه شما طراحی شده‌اند و در عین حال باعث افزایش تعامل و جلب توجه بیشتر به کمپین‌های بازاریابی شما می‌شوند.",
  },
  {
    name: "طراحی و لمس",
    content:
      "Qoo Box یک تجربه تعاملی با صفحه‌نمایش لمسی است که برای معرفی پروژه‌های املاک در قالبی شیک و کاربرپسند طراحی شده است. کاربران با یک لمس ساده می‌توانند نقشه‌های طبقات را مرور کنند، رندرهای فوتورئالیستیک و انیمیشن‌ها را مشاهده کنند و حتی فضای داخلی را سفارشی‌سازی کنند — راهکاری پویا و غوطه‌ور برای تعامل با پروژه.",
  },
];

export default function Tabs() {
  const [activeIndex, setActiveIndex] = useState(0); // Qoo Design Studio by default

  return (
    <div className="mx-auto px-4 py-10 text-center bg-white">
      <div className="flex flex-wrap justify-center gap-4 border-b border-gray-200">
        {tabs.map((tab, index) => (
          <button
            key={tab.name}
            onClick={() => setActiveIndex(index)}
            className={`relative px-4 sm:px-6 py-2 text-[16px] sm:text-[18px] md:text-[20px] font-semibold transition-all duration-300
           ${
             activeIndex === index
               ? "text-black after:content-[''] after:absolute after:inset-x-0 after:-bottom-1 after:h-[3px] after:bg-black after:rounded-full"
               : "text-gray-900 hover:text-black"
           }`}
          >
            {tab.name}
          </button>
        ))}
      </div>

      <div className="mt-8 pt-10 pb-16 text-gray-900 text-[14px] sm:text-[16px] md:text-[18px] font-semibold leading-relaxed max-w-4xl mx-auto text-justify px-4">
        <p>{tabs[activeIndex].content}</p>
      </div>
    </div>
  );
}
